balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18F4480.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B1D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B1D3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B1D30" edc:desc="" edc:mask="0x1" edc:name="B1D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D31" edc:desc="" edc:mask="0x1" edc:name="B1D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D32" edc:desc="" edc:mask="0x1" edc:name="B1D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D33" edc:desc="" edc:mask="0x1" edc:name="B1D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D34" edc:desc="" edc:mask="0x1" edc:name="B1D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D35" edc:desc="" edc:mask="0x1" edc:name="B1D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D36" edc:desc="" edc:mask="0x1" edc:name="B1D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D37" edc:desc="" edc:mask="0x1" edc:name="B1D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B1D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B1D4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B1D40" edc:desc="" edc:mask="0x1" edc:name="B1D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D41" edc:desc="" edc:mask="0x1" edc:name="B1D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D42" edc:desc="" edc:mask="0x1" edc:name="B1D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D43" edc:desc="" edc:mask="0x1" edc:name="B1D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D44" edc:desc="" edc:mask="0x1" edc:name="B1D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D45" edc:desc="" edc:mask="0x1" edc:name="B1D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D46" edc:desc="" edc:mask="0x1" edc:name="B1D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D47" edc:desc="" edc:mask="0x1" edc:name="B1D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B1D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B1D5" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B1D50" edc:desc="" edc:mask="0x1" edc:name="B1D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D51" edc:desc="" edc:mask="0x1" edc:name="B1D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D52" edc:desc="" edc:mask="0x1" edc:name="B1D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D53" edc:desc="" edc:mask="0x1" edc:name="B1D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D54" edc:desc="" edc:mask="0x1" edc:name="B1D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D55" edc:desc="" edc:mask="0x1" edc:name="B1D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D56" edc:desc="" edc:mask="0x1" edc:name="B1D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D57" edc:desc="" edc:mask="0x1" edc:name="B1D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B1D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B1D6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B1D60" edc:desc="" edc:mask="0x1" edc:name="B1D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D61" edc:desc="" edc:mask="0x1" edc:name="B1D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D62" edc:desc="" edc:mask="0x1" edc:name="B1D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D63" edc:desc="" edc:mask="0x1" edc:name="B1D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D64" edc:desc="" edc:mask="0x1" edc:name="B1D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D65" edc:desc="" edc:mask="0x1" edc:name="B1D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D66" edc:desc="" edc:mask="0x1" edc:name="B1D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D67" edc:desc="" edc:mask="0x1" edc:name="B1D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B1D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B1D7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B1D70" edc:desc="" edc:mask="0x1" edc:name="B1D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D71" edc:desc="" edc:mask="0x1" edc:name="B1D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D72" edc:desc="" edc:mask="0x1" edc:name="B1D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D73" edc:desc="" edc:mask="0x1" edc:name="B1D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D74" edc:desc="" edc:mask="0x1" edc:name="B1D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D75" edc:desc="" edc:mask="0x1" edc:name="B1D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D76" edc:desc="" edc:mask="0x1" edc:name="B1D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D77" edc:desc="" edc:mask="0x1" edc:name="B1D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT_RO8" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT_RO8" edc:nzwidth="0x8" edc:por="10000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1_ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2_ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3_ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE" edc:desc="" edc:mask="0x7" edc:name="OPMODE" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE3" edc:desc="" edc:mask="0x1" edc:name="ICODE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE4" edc:desc="" edc:mask="0x1" edc:name="ICODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
